stress-test.yml
config:
  target: 'http://18.212.13.974:3001'
  phases:
    - duration: 300
      arrivalRate: 1000

scenarios:
  - flow:
      - get:
          url: '/products/10000000'
      # - post:
      #     url: '/products/'
      #     json:
      # brand: 'brand'
      # title: 'title'
      # averageRating: 23
      # reviewCount: 23
      # freeShipping: 'true'
      # shippingRestriction: 'false'