stress-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 100
      arrivalRate: 1800

scenarios:
  - flow:
      - get:
          url: '/products/10000000'
      # - post:
      #     url: '/products/'
      #     json:
      #       brand: 'brand'
      #       title: 'title'
      #       averageRating: 23
      #       reviewCount: 23
      #       freeShipping: 'true'
      #       shippingRestriction: 'false'